log/Lion/LionSOAPRequestLogon.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.vedaleon.com/webservices" xmlns:ns2="http://www.ebxml.org/namespaces/messageHeader" xmlns:ns3="http://schemas.xmlsoap.org/ws/2002/12/secext"><SOAP-ENV:Header><ns2:MessageHeader><ns2:CPAId>JT</ns2:CPAId><ns2:Service>Create</ns2:Service><ns2:Action>CreateSession</ns2:Action><ns2:MessageData><ns2:MessageId>mid:13:30:03.161@vedaleon.com</ns2:MessageId></ns2:MessageData></ns2:MessageHeader><ns3:Security><ns3:UsernameToken><ns3:Username>versa_travel</ns3:Username><ns3:Password>Versa12*</ns3:Password><Organization>JT</Organization></ns3:UsernameToken></ns3:Security></SOAP-ENV:Header><SOAP-ENV:Body><ns1:Logon/></SOAP-ENV:Body></SOAP-ENV:Envelope>

